; domain
(define (domain strips-sliding-tile)

    (:requirements :strips)
    (:predicates (tile ?x) (position ?x) (at ?t ?x ?y) (blank ?x ?y)
                (inc ?p ?pp) (dec ?p ?pp)
    )
    (:action move-up
        :parameters (?ex ?ey ?t ?tx)
        :precondition (and (tile ?t) (position ?ex) (position ?ey) (position ?tx) 
                    (dec ?ex ?tx) (blank ?ex ?ey) (at ?t ?tx ?ey))
        :effect (and (not (blank ?ex ?ey)) (not (at ?t ?tx ?ey))
                    (blank ?tx ?ey) (at ?t ?ex ?ey))
    )
    (:action move-down
        :parameters (?ex ?ey ?t ?tx)
        :precondition (and (tile ?t) (position ?ex) (position ?ey)  (position ?tx)
                    (inc ?ex ?tx) (blank ?ex ?ey) (at ?t ?tx ?ey))
        :effect (and (not (blank ?ex ?ey)) (not (at ?t ?tx ?ey))
                    (blank ?tx ?ey) (at ?t ?ex ?ey))
    )
    (:action move-left
        :parameters (?ex ?ey ?t ?ty)
        :precondition (and (tile ?t) (position ?ex) (position ?ey)  (position ?ty)
                    (dec ?ey ?ty) (blank ?ex ?ey) (at ?t ?ex ?ty))
        :effect (and (not (blank ?ex ?ey)) (not (at ?t ?ex ?ty))
                    (blank ?ex ?ty) (at ?t ?ex ?ey))
    )
    (:action move-right
        :parameters (?ex ?ey ?t ?ty)
        :precondition (and (tile ?t) (position ?ex) (position ?ey)  (position ?ty)
                    (inc ?ey ?ty) (blank ?ex ?ey) (at ?t ?ex ?ty))
        :effect (and (not (blank ?ex ?ey)) (not (at ?t ?ex ?ty))
                    (blank ?ex ?ty) (at ?t ?ex ?ey))
    )
)

; problem
(define (problem hard1)
    (:domain strips-sliding-tile)
    (:objects t1 t2 t3 t4 t5 t6 t7 t8 x1 x2 x3 y1 y2 y3)
    (:init  (tile t1) (tile t2) (tile t3) (tile t4) 
            (tile t5) (tile t6) (tile t7) (tile t8) 
            (position x1) (position x2) (position x3) 
            (position y1) (position y2) (position y3) 
            (inc x1 x2) (inc x2 x3) (dec x3 x2) (dec x2 x1)
            (inc y1 y2) (inc y2 y3) (dec y3 y2) (dec y2 y1)
            (blank x2 y3)
            (at t2 x1 y1) (at t3 x2 y1) (at t7 x3 y1) (at t1 x1 y2) 
            (at t5 x2 y2) (at t4 x3 y2) (at t8 x1 y3) (at t6 x3 y3)
    )
    (:goal  (and (at t1 x1 y1) (at t2 x2 y1) (at t3 x3 y1) (at t4 x1 y2) 
                (at t5 x2 y2) (at t6 x3 y2) (at t7 x1 y3) (at t8 x2 y3))
    )
)

; plan
1. (move-up x2 y3 t8 x1)
   deleted: (blank x2 y3) (at t8 x1 y3)
   added: (blank x1 y3) (at t8 x2 y3)
   goals met: 2 of 8
2. (move-left x1 y3 t1 y2)
   deleted: (blank x1 y3) (at t1 x1 y2)
   added: (blank x1 y2) (at t1 x1 y3)
   goals met: 2 of 8
3. (move-down x1 y2 t5 x2)
   deleted: (blank x1 y2) (at t5 x2 y2)
   added: (blank x2 y2) (at t5 x1 y2)
   goals met: 1 of 8
4. (move-down x2 y2 t4 x3)
   deleted: (blank x2 y2) (at t4 x3 y2)
   added: (blank x3 y2) (at t4 x2 y2)
   goals met: 1 of 8
5. (move-right x3 y2 t6 y3)
   deleted: (blank x3 y2) (at t6 x3 y3)
   added: (blank x3 y3) (at t6 x3 y2)
   goals met: 2 of 8
6. (move-up x3 y3 t8 x2)
   deleted: (blank x3 y3) (at t8 x2 y3)
   added: (blank x2 y3) (at t8 x3 y3)
   goals met: 1 of 8
7. (move-left x2 y3 t4 y2)
   deleted: (blank x2 y3) (at t4 x2 y2)
   added: (blank x2 y2) (at t4 x2 y3)
   goals met: 1 of 8
8. (move-up x2 y2 t5 x1)
   deleted: (blank x2 y2) (at t5 x1 y2)
   added: (blank x1 y2) (at t5 x2 y2)
   goals met: 2 of 8
9. (move-right x1 y2 t1 y3)
   deleted: (blank x1 y2) (at t1 x1 y3)
   added: (blank x1 y3) (at t1 x1 y2)
   goals met: 2 of 8
10. (move-down x1 y3 t4 x2)
   deleted: (blank x1 y3) (at t4 x2 y3)
   added: (blank x2 y3) (at t4 x1 y3)
   goals met: 2 of 8
11. (move-down x2 y3 t8 x3)
   deleted: (blank x2 y3) (at t8 x3 y3)
   added: (blank x3 y3) (at t8 x2 y3)
   goals met: 3 of 8
12. (move-left x3 y3 t6 y2)
   deleted: (blank x3 y3) (at t6 x3 y2)
   added: (blank x3 y2) (at t6 x3 y3)
   goals met: 2 of 8
13. (move-left x3 y2 t7 y1)
   deleted: (blank x3 y2) (at t7 x3 y1)
   added: (blank x3 y1) (at t7 x3 y2)
   goals met: 2 of 8
14. (move-up x3 y1 t3 x2)
   deleted: (blank x3 y1) (at t3 x2 y1)
   added: (blank x2 y1) (at t3 x3 y1)
   goals met: 3 of 8
15. (move-up x2 y1 t2 x1)
   deleted: (blank x2 y1) (at t2 x1 y1)
   added: (blank x1 y1) (at t2 x2 y1)
   goals met: 4 of 8
16. (move-right x1 y1 t1 y2)
   deleted: (blank x1 y1) (at t1 x1 y2)
   added: (blank x1 y2) (at t1 x1 y1)
   goals met: 5 of 8
17. (move-down x1 y2 t5 x2)
   deleted: (blank x1 y2) (at t5 x2 y2)
   added: (blank x2 y2) (at t5 x1 y2)
   goals met: 4 of 8
18. (move-down x2 y2 t7 x3)
   deleted: (blank x2 y2) (at t7 x3 y2)
   added: (blank x3 y2) (at t7 x2 y2)
   goals met: 4 of 8
19. (move-right x3 y2 t6 y3)
   deleted: (blank x3 y2) (at t6 x3 y3)
   added: (blank x3 y3) (at t6 x3 y2)
   goals met: 5 of 8
20. (move-up x3 y3 t8 x2)
   deleted: (blank x3 y3) (at t8 x2 y3)
   added: (blank x2 y3) (at t8 x3 y3)
   goals met: 4 of 8
21. (move-left x2 y3 t7 y2)
   deleted: (blank x2 y3) (at t7 x2 y2)
   added: (blank x2 y2) (at t7 x2 y3)
   goals met: 4 of 8
22. (move-up x2 y2 t5 x1)
   deleted: (blank x2 y2) (at t5 x1 y2)
   added: (blank x1 y2) (at t5 x2 y2)
   goals met: 5 of 8
23. (move-right x1 y2 t4 y3)
   deleted: (blank x1 y2) (at t4 x1 y3)
   added: (blank x1 y3) (at t4 x1 y2)
   goals met: 6 of 8
24. (move-down x1 y3 t7 x2)
   deleted: (blank x1 y3) (at t7 x2 y3)
   added: (blank x2 y3) (at t7 x1 y3)
   goals met: 7 of 8
25. (move-down x2 y3 t8 x3)
   deleted: (blank x2 y3) (at t8 x3 y3)
   added: (blank x3 y3) (at t8 x2 y3)
   goals met: 8 of 8
